{
  "id": "giving-and-receiving-love",
  "title": "Giving and Receiving Love",
  "durationMinutes": 8,
  "audioSrc": "",
  "intro": "A gentle breathing meditation using a ball of light — receiving love on the inhale, offering it on the exhale.",
  "body": "Hi.\n\nTake a moment to arrive.\nLet your shoulders loosen. Let your jaw soften.\nAnd if it feels okay, allow your breathing to become a little slower — not forced, just gently guided.\n\nImagine, as you breathe in, that a small ball of warm light begins to form inside you.\nNot a spotlight. Not something blinding.\nJust a soft glow — steady, kind, and calm.\n\nAs you inhale, the light gathers.\nAs you exhale, it stays with you.\nYou don’t have to do it perfectly.\nJust imagine the light responding to your breath.\n\nNow, bring to mind someone you care about.\nSomeone who feels safe to love.\nIt could be a partner, a friend, a family member, a pet.\nOr someone who has supported you in a quiet way.\n\nOn your next inhale, let the ball of light grow a little brighter.\nLet it collect warmth.\nLet it gather tenderness.\n\nAnd as you exhale, imagine offering that light to this person.\nNot as a sacrifice.\nNot as something you lose.\nBut as something you can share.\nA gentle gift.\nA kind sending.\n\nInhale… the light gathers in you.\nExhale… the light moves toward them.\n\nYou might imagine it traveling as a soft stream.\nOr leaving your chest like a warm breath.\nOr drifting like a lantern through the air.\nHowever it appears is okay.\n\nTake a few breaths like this.\nInhale — receive love.\nExhale — offer love.\n\nNow, if you feel ready, bring to mind someone neutral.\nSomeone you see in passing.\nA cashier, a neighbor, a stranger on the street.\nSomeone whose life you don’t know.\n\nInhale — let the light gather.\nExhale — offer it toward them.\nNot because you owe them anything.\nBut because kindness can be practice.\nBecause love can be widened.\n\nNow, gently, only if it feels safe… bring to mind someone difficult.\nThis is not about excusing harm.\nIt’s not about pretending.\nIt’s not about forcing forgiveness.\n\nThis is about freeing your own heart from constant tension.\nAbout loosening the grip that pain can have.\n\nChoose someone who feels difficult in a manageable way.\nNot the most painful person, if that feels too much.\nJust someone your mind tightens around.\n\nNotice what happens in your body.\nMaybe a clench. A heat. A heaviness.\nThat’s okay.\nYou don’t have to push it away.\n\nNow inhale — and gather the light.\nNot bright. Not dramatic.\nJust steady.\nA small, quiet glow.\n\nAnd as you exhale, offer the light anyway.\nNot to say “what happened was fine.”\nBut to say:\n“May you be held by life.\nMay you be softened.\nMay you be healed in whatever way you need.\nAnd may I be free.”\n\nInhale — light gathers.\nExhale — light releases.\n\nIf resistance rises, that’s normal.\nYou can return to a safer person.\nOr you can offer the light to yourself instead.\nBecause you are part of this practice too.\n\nSo now, bring the light back home.\nInhale — let the glow fill your chest.\nExhale — let it spread through your shoulders, your belly, your hands.\n\nIf it helps, place a hand over your heart.\nAnd offer the light to yourself.\n\nInhale — receiving.\nExhale — giving.\n\nYou don’t have to get it right.\nYou only have to be willing.\n\nWhen you’re ready, let the image of the light become softer.\nLet your breath return to its natural rhythm.\n\nAnd before you go, take one last gentle inhale.\nAnd one last gentle exhale.\n\nThank you for taking this moment.\nYou can come back to this practice whenever you need."
}
